from django.db import models

# Create your models here.
# модели - это классы, которые описывают структуру данных, которые мы будем хранить в нашей базе данных.
# Они определяют поля и типы данных, которые будут использоваться для хранения информации о наших товарах, категориях и т.д.
# Каждая модель будет соответствовать одной таблице в базе данных.
# Когда мы создаем модель, Django автоматически создает таблицу в базе данных для хранения данных этой модели.
# models это конструкция для образования баз данных, которая позволяет нам создавать таблицы и управлять ими через код, а не напрямую через базу данных.


class Category(models.Model):
    name = models.CharField(max_length=100, db_index=True)
    # db_index=True - это параметр, который говорит Django создать индекс для этого поля в базе данных.
    # Это может ускорить поиск по этому полю, особенно если у нас будет много записей в таблице.

    slug = models.SlugField(max_length=100, unique=True)
    # SlugField - это специальный тип поля, который используется для хранения "человеко-понятных" URL-адресов.
    # unique=True - это параметр, который говорит Django, что значения в этом поле должны быть уникальными, то есть не может быть двух категорий с одинаковым slug.

    class Meta:  # это внутренний класс, который используется для настройки модели.
        ordering = ("name",)
        # verbose_name - это параметр, который задает человеко-понятное имя для модели, которое будет использоваться в административной панели Django.
        verbose_name = "Категория"
        verbose_name_plural = "Категории"

        # ordering - это параметр, который говорит Django, как сортировать записи при извлечении из базы данных.
        # В данном случае, записи будут сортироваться по полю name в алфавитном порядке.

    def __str__(self):
        # это метод, который возвращает строковое представление объекта.
        # Он используется для отображения объектов в административной панели и других местах, где требуется строковое представление объекта.
        return self.name


class Product(models.Model):
    category = models.ForeignKey(
        Category, related_name="products", on_delete=models.CASCADE)
    # параметр category - это внешний ключ, который связывает продукт с категорией. то есть имеет имяб slug и тд
    # related_name="products" - это параметр, который позволяет нам обращаться к продуктам категории через атрибут products, например category.products.all() вернет все продукты, связанные с этой категорией.
    # on_delete=models.CASCADE - это параметр, который говорит Django, что делать с продуктами, если их категория будет удалена. В данном случае, CASCADE означает, что все продукты, связанные с удаленной категорией, также будут удалены.
    name = models.CharField(max_length=100, db_index=True)
    slug = models.SlugField(max_length=100, unique=100)
    image = models.ImageField(upload_to="products/%Y/%m/%d", blank=True)
    # это поле для хранения изображения продукта.
    # upload_to - это параметр, который говорит Django, куда сохранять загруженные изображения.
    # В данном случае, изображения будут сохраняться в папке products, внутри которой будут создаваться папки по годам, месяцам и дням загрузки.
    # blank=True - это параметр, который говорит Django, что это поле может быть пустым, то есть не обязательно для заполнения при создании продукта.
    description = models.TextField(blank=True)
    price = models.DecimalField(max_digits=10, decimal_places=2)
    available = models.BooleanField(default=True)
    created = models.DateTimeField(auto_now_add=True)
    updated = models.DateTimeField(auto_now=True)

    class Meta:
        ordering = ("name",)

    def __str__(self):
        return self.name
