from django import forms


class CartAddProductForm(forms.Form):
    quantity = forms.IntegerField(min_value=1, max_value=20, initial=1,
                                  widget=forms.NumberInput(attrs={'class': 'form-control'}))
    # это поле для ввода количества товара, который пользователь хочет добавить в корзину.
    #  Мы используем IntegerField, чтобы гарантировать, что ввод будет числом, и задаем минимальное и максимальное значение,
    # чтобы ограничить количество товара, которое можно добавить. Мы также используем виджет NumberInput,
    # чтобы отображать поле ввода в виде числового поля с кнопками для увеличения и уменьшения значения.
    # form-control - это класс Bootstrap, который добавляет стили к полю ввода.

    override = forms.BooleanField(
        required=False, initial=False, widget=forms.HiddenInput)
    # это поле для указания, нужно ли заменить существующее количество товара в корзине новым количеством,
    # или добавить к существующему количеству. Мы используем BooleanField, чтобы создать флажок, который будет указывать на это.
    # Мы также используем HiddenInput, чтобы скрыть это поле от пользователя, так как он не должен видеть его на странице.
